// Исходный массив
arr1 =  [15, 20, 30, 14, 454, 30, 56, 10, 12, 20, 30, 5, 1,320,55, 126];

/*
    Задача 1
    Дан массив arr1, необходимо в перевернутом массиве вывести каждый элемент в документ.
 */
arr1.reverse();
arr1.forEach(function (element) {
    document.write(element + " ");
});

/*
    Задача 2
    Необходимо отсортированный массив arr1 вывести в консоль.
 */
arr1 =  [15, 20, 30, 14, 454, 30, 56, 10, 12, 20, 30, 5, 1,320,55, 126];
arr1.sort(function (a, b) {
    return a - b;
});
console.log(arr1);

/*
    Задача 3
    Необходимо найти  сумму элементов массива arr1 .
 */
arr1 =  [15, 20, 30, 14, 454, 30, 56, 10, 12, 20, 30, 5, 1,320,55, 126];
let sumOfArr = arr1.reduce(function (accum, element) {
    return accum + element;
});
document.write('<br>');
document.write("Сумма всех элементов массива = ");
document.write(sumOfArr);

/*
    Задача 4
    Необходимо проверить на присутствие этих значений [78, 14, 12 ] в массиве arr1.
 */
arr1 =  [15, 20, 30, 14, 454, 30, 56, 10, 12, 20, 30, 5, 1,320,55, 126];
let arr = [78, 14, 12 ];
let result = arr.every(function(item) {
    return arr1.indexOf(item) !== -1;
});
document.write('<br>');
let answer = result ? "Значения [78, 14, 12 ] присутствуют в массиве" : "Значения [78, 14, 12 ] не присутствуют в массиве";
document.write(answer);

/*
    Задача 5
    Необходимо найти все индексы числа 30 в массиве arr1.
 */
arr1 =  [15, 20, 30, 14, 454, 30, 56, 10, 12, 20, 30, 5, 1,320,55, 126];
let arrIndex = [];
for (let i = 0; i < arr1.length; i++){
    if (arr1[i] === 30)
        arrIndex.push(i);
}
document.write('<br>');
document.write("Индексы числа 30 в массиве: ")
document.write(arrIndex);

/*
    Задача 6
    Реализовать гибкий метод удаления первой половины массива arr1(предусмотреть возможность добавления или
    удаления элементов из массива)
 */



/*
    Задача 7
    Преобразовать массив arr1 в строку с разделителем ‘;’
 */
arr1 =  [15, 20, 30, 14, 454, 30, 56, 10, 12, 20, 30, 5, 1,320,55, 126];
let str = arr1.join(';');
document.write('<br>');
document.write("Массив с раздилителем ';' : ");
document.write(str);

/*
    Задача 8
    Создать новый массив из массива arr1 в котором остануться значения больше 50 и меньше 300
 */
arr1 =  [15, 20, 30, 14, 454, 30, 56, 10, 12, 20, 30, 5, 1,320,55, 126];
let resArr = arr1.filter(function (elem) {
    return elem > 50 && elem < 300;
})
document.write('<br>');
document.write("Элементы массива в диапазоне от 50 до 300: ");
document.write(resArr);